Kim-J-Smith/CH32-SimpleButton/kim_ch32v_button.h
/* Macro to connect macro */
#define KIM_BUTTON_CONNECT(_a, _b)          KIM_BUTTON_CONNECT_1(_a, _b)
#define KIM_BUTTON_CONNECT_1(_a, _b)        KIM_BUTTON_CONNECT_2(_a, _b)
#define KIM_BUTTON_CONNECT_2(_a, _b)        _a ## _b

#define KIM_BUTTON_CONNECT3(_a, _b, _c)     KIM_BUTTON_CONNECT3_1(_a, _b, _c)
#define KIM_BUTTON_CONNECT3_1(_a, _b, _c)   KIM_BUTTON_CONNECT3_2(_a, _b, _c)
#define KIM_BUTTON_CONNECT3_2(_a, _b, _c)   _a ## _b ## _c

/**
 * @p               [private-use]
 * @brief           Initialize the struct self.
 * @param[inout]    self - pointer to self struct.
 * @param[in]       method_asynchronous_handler - function pointer to the method named 
 *                  `Kim_Button_Asynchronous_Handler_ ## __name` [static].
 * @param[in]       method_interrupt_handler - function pointer to the method named 
 *                  `Kim_Button_Handler_During_IT_ ## __name` [static].
 */
KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_InitStructSelf(
    struct Kim_Button_TypeDef* const self,
    void (* method_asynchronous_handler) (
        Kim_Button_ShortPushCallBack_t short_push_callback,
        Kim_Button_LongPushCallBack_t long_push_callback,
        Kim_Button_RepeatPushCallBack_t repeat_push_callback
    ),
    void (* method_interrupt_handler) (void)
)
{
    /* Initialize only once */
    self->private_is_init = 1;

    /* Initialize the member variables */
    self->private_push_time = 0;
    self->private_time_stamp_loop = 0;

    /* volatile variables */
    KIM_BUTTON_CRITICAL_ZONE_BEGIN();
    self->private_state = Kim_Button_State_Wait_For_Interrupt;
    self->private_time_stamp_interrupt = 0;
    KIM_BUTTON_CRITICAL_ZONE_END();

    /* public variables */
#if KIM_BUTTON_ONLY_USE_DEFAULT_TIME == 0
    self->public_long_push_min_time = KIM_BUTTON_LONG_PUSH_MIN_TIME;
    self->public_cool_down_time = KIM_BUTTON_COOL_DOWN_TIME;
    self->public_repeat_push_max_time = KIM_BUTTON_REPEAT_PUSH_MAX_TIME;
#endif /* KIM_BUTTON_ONLY_USE_DEFAULT_TIME */

    /* Initialize the public method */
    self->method_asynchronous_handler = method_asynchronous_handler;
    self->method_interrupt_handler = method_interrupt_handler;

    /* combination button */
#if KIM_BUTTON_ENABLE_BUTTON_COMBINATION != 0

    self->public_comb_before_button = 0;
    self->public_comb_callback = 0;

#endif /* combination button */

}

/**
 * @p               [private-use]
 * @brief           Initialize the SysTick.
 */
KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_InitSysTick(void)
{
    /* SysTick configure */
    const uint32_t SysTick_Msk_Mode = (uint32_t)(1U << 4);
    const uint32_t SysTick_Msk_STCLK = (uint32_t)(1U << 2);
    const uint32_t SysTick_Msk_SWIE = (uint32_t)(1U << 31);

    const uint32_t SysTick_Msk_Init = (uint32_t)(1U << 5);
    const uint32_t SysTick_Msk_Enable = (uint32_t)(1U << 0);

    /* use Mode-Up Clock-Div8 SWInterrupt-Disable */
    SysTick->CTLR &= ~(SysTick_Msk_Mode | SysTick_Msk_STCLK | SysTick_Msk_SWIE);

    /* Init and Enable */
    SysTick->CTLR |= SysTick_Msk_Init | SysTick_Msk_Enable;
}

/**
 * @p               [private-use]
 * @brief           Initialize the EXTI.
 * @param[in]       gpiox_base - can be GPIOA_BASE / GPIOB_BASE / GPIOC_BASE / ...
 * @param[in]       gpio_pin_x - can be GPIO_PIN_0 / GPIO_PIN_1 / ... / GPIO_PIN_15.
 * @param[in]       exti_trigger_x - can be EXTI_TRIGGER_RISING or EXTI_TRIGGER_FALLING.
 */
KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_InitEXTI(
    const uint32_t gpiox_base,
    const uint16_t gpio_pin_x,
    const EXTITrigger_TypeDef exti_trigger_x
)
{

    /* Initialize the GPIOx Clock */
    GPIO_InitTypeDef gpio_config;    
    uint8_t PortSource;         
    uint8_t PinSource;          
    uint32_t EXTI_Line;         
    EXTI_InitTypeDef exti_config;    
    NVIC_InitTypeDef nvic_config;
                
    /* static constexpr assign values to variables */                                               \
    switch(gpiox_base)
    {         
    case GPIOA_BASE:            
        PortSource = GPIO_PortSourceGPIOA;                                                          \
        break;
    case GPIOB_BASE:            
        PortSource = GPIO_PortSourceGPIOB;                                                          \
        break;
    case GPIOC_BASE:            
        PortSource = GPIO_PortSourceGPIOC;                                                          \
        break;
    case GPIOD_BASE:            
        PortSource = GPIO_PortSourceGPIOD;                                                          \
        break;
    case GPIOE_BASE:            
        PortSource = GPIO_PortSourceGPIOE;                                                          \
        break;
    default:  
        /* ... error handler ... */  
        break;
    }         
                
    switch(gpio_pin_x)
    {         
    case GPIO_Pin_0:            
        PinSource = GPIO_PinSource0; 
        EXTI_Line = EXTI_Line0; 
        nvic_config.NVIC_IRQChannel = EXTI0_IRQn;                                                   \
        break;
    case GPIO_Pin_1:            
        PinSource = GPIO_PinSource1; 
        EXTI_Line = EXTI_Line1; 
        nvic_config.NVIC_IRQChannel = EXTI1_IRQn;                                                   \
        break;
    case GPIO_Pin_2:            
        PinSource = GPIO_PinSource2; 
        EXTI_Line = EXTI_Line2; 
        nvic_config.NVIC_IRQChannel = EXTI2_IRQn;                                                   \
        break;
    case GPIO_Pin_3:            
        PinSource = GPIO_PinSource3; 
        EXTI_Line = EXTI_Line3; 
        nvic_config.NVIC_IRQChannel = EXTI3_IRQn;                                                   \
        break;
    case GPIO_Pin_4:            
        PinSource = GPIO_PinSource4; 
        EXTI_Line = EXTI_Line4; 
        nvic_config.NVIC_IRQChannel = EXTI4_IRQn;                                                   \
        break;
    case GPIO_Pin_5:            
        PinSource = GPIO_PinSource5; 
        EXTI_Line = EXTI_Line5; 
        nvic_config.NVIC_IRQChannel = EXTI9_5_IRQn;                                                 \
        break;
    case GPIO_Pin_6:            
        PinSource = GPIO_PinSource6; 
        EXTI_Line = EXTI_Line6; 
        nvic_config.NVIC_IRQChannel = EXTI9_5_IRQn;                                                 \
        break;
    case GPIO_Pin_7:            
        PinSource = GPIO_PinSource7; 
        EXTI_Line = EXTI_Line7; 
        nvic_config.NVIC_IRQChannel = EXTI9_5_IRQn;                                                 \
        break;
    case GPIO_Pin_8:            
        PinSource = GPIO_PinSource8; 
        EXTI_Line = EXTI_Line8; 
        nvic_config.NVIC_IRQChannel = EXTI9_5_IRQn;                                                 \
        break;
    case GPIO_Pin_9:            
        PinSource = GPIO_PinSource9; 
        EXTI_Line = EXTI_Line9; 
        nvic_config.NVIC_IRQChannel = EXTI9_5_IRQn;                                                 \
        break;
    case GPIO_Pin_10:           
        PinSource = GPIO_PinSource10;
        EXTI_Line = EXTI_Line10;
        nvic_config.NVIC_IRQChannel = EXTI15_10_IRQn;                                               \
        break;
    case GPIO_Pin_11:           
        PinSource = GPIO_PinSource11;
        EXTI_Line = EXTI_Line11;
        nvic_config.NVIC_IRQChannel = EXTI15_10_IRQn;                                               \
        break;
    case GPIO_Pin_12:           
        PinSource = GPIO_PinSource12;
        EXTI_Line = EXTI_Line12;
        nvic_config.NVIC_IRQChannel = EXTI15_10_IRQn;                                               \
        break;
    case GPIO_Pin_13:           
        PinSource = GPIO_PinSource13;
        EXTI_Line = EXTI_Line13;
        nvic_config.NVIC_IRQChannel = EXTI15_10_IRQn;                                               \
        break;
    case GPIO_Pin_14:           
        PinSource = GPIO_PinSource14;
        EXTI_Line = EXTI_Line14;
        nvic_config.NVIC_IRQChannel = EXTI15_10_IRQn;                                               \
        break;
    case GPIO_Pin_15:           
        PinSource = GPIO_PinSource15;
        EXTI_Line = EXTI_Line15;
        nvic_config.NVIC_IRQChannel = EXTI15_10_IRQn;                                               \
        break;
    default:  
        /* ... error handler ... */
        break;
    }

    /* GPIO & AFIO Init */
    RCC_APB2PeriphClockCmd( ((gpiox_base == GPIOA_BASE)
        * RCC_APB2Periph_GPIOA + (gpiox_base == GPIOB_BASE)
        * RCC_APB2Periph_GPIOB + (gpiox_base == GPIOC_BASE)
        * RCC_APB2Periph_GPIOC + (gpiox_base == GPIOD_BASE)
        * RCC_APB2Periph_GPIOD + (gpiox_base == GPIOE_BASE)
        * RCC_APB2Periph_GPIOE), ENABLE );
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

    gpio_config.GPIO_Pin    = gpio_pin_x;
    gpio_config.GPIO_Speed  = GPIO_Speed_2MHz;
    gpio_config.GPIO_Mode   = (GPIOMode_TypeDef)
        ((exti_trigger_x == EXTI_Trigger_Falling)
        * GPIO_Mode_IPU + (exti_trigger_x == EXTI_Trigger_Rising)
        * GPIO_Mode_IPD);
    GPIO_Init((GPIO_TypeDef*)gpiox_base, &gpio_config);

    GPIO_EXTILineConfig(PortSource, PinSource);
    exti_config.EXTI_Line = EXTI_Line;
    exti_config.EXTI_Mode = EXTI_Mode_Interrupt;
    exti_config.EXTI_Trigger = exti_trigger_x;
    exti_config.EXTI_LineCmd = ENABLE;
    EXTI_Init(&exti_config);

