Kim-J-Smith/CH32-SimpleButton/kim_ch32v_button.h
    nvic_config.NVIC_IRQChannelPreemptionPriority = KIM_BUTTON_NVIC_EXTI_PreemptionPriority;
    nvic_config.NVIC_IRQChannelSubPriority = KIM_BUTTON_NVIC_EXTI_PreemptionPriority;
    nvic_config.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&nvic_config);
}

/** 
 * @p               [private-use]
 * @brief           Init the Button, including the GPIO, EXTI and NVIC.
 * @param[inout]    self - pointer to self struct.
 * @param[in]       gpiox_base - can be GPIOA_BASE / GPIOB_BASE / GPIOC_BASE / ...
 * @param[in]       gpio_pin_x - can be GPIO_PIN_0 / GPIO_PIN_1 / ... / GPIO_PIN_15.
 * @param[in]       exti_trigger_x - can be EXTI_TRIGGER_RISING or EXTI_TRIGGER_FALLING.
 * @param[in]       method_asynchronous_handler - function pointer to the method named 
 *                  `Kim_Button_Asynchronous_Handler_ ## __name` [static].
 * @param[in]       method_interrupt_handler - function pointer to the method named 
 *                  `Kim_Button_Handler_During_IT_ ## __name` [static].
 * @return          None
 */
KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_InitButton(
    struct Kim_Button_TypeDef* const self,
    const uint32_t gpiox_base,
    const uint16_t gpio_pin_x,
    const EXTITrigger_TypeDef exti_trigger_x,
    void (* method_asynchronous_handler) (
        Kim_Button_ShortPushCallBack_t short_push_callback,
        Kim_Button_LongPushCallBack_t long_push_callback,
        Kim_Button_RepeatPushCallBack_t repeat_push_callback
    ),
    void (* method_interrupt_handler) (void)
)
{
    /* Check whether it is first time to init */
    if(self->private_is_init != 0) {
#if defined(KIM_BUTTON_DEBUG)
        KIM_BUTTON_DEBUG_ERROR_HOOK();
#else
        return;
#endif /* DEBUG MODE */
    }

    /* Initialize the struct self */
    Kim_Button_PrivateUse_InitStructSelf(
        self,
        method_asynchronous_handler,
        method_interrupt_handler
    );

    /* Initialize the SysTick (include SysTick's NVIC) */
    Kim_Button_PrivateUse_InitSysTick();

    /* Initialize the EXTI (include EXTI's NVIC) */
    Kim_Button_PrivateUse_InitEXTI(gpiox_base, gpio_pin_x, exti_trigger_x);
}

/**
 * @p               [private-use]
 * @brief           Change the status of each button when during the EXTI interrupt
 *                  service routine.
 * @param[inout]    self - pointer to self struct.
 * @return          None
 */
KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_ITHandler(
    struct Kim_Button_TypeDef* const self
)
{
    if( ((enum Kim_Button_State)self->private_state) == Kim_Button_State_Wait_For_Repeat
        || ((enum Kim_Button_State)self->private_state) == Kim_Button_State_Wait_For_Interrupt) 
    {
        self->private_time_stamp_interrupt = KIM_BUTTON_GET_TICK();
        self->private_state = Kim_Button_State_Push_Delay;
    }
}

KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_StateWFIHandler(void)
{
    /* do nothing */
}

KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_StatePushDelayHandler(
    struct Kim_Button_TypeDef* const self,
    const uint32_t gpiox_base,
    const uint16_t gpio_pin_x,
    const uint8_t Normal_Bit_Val
)
{
    if(KIM_BUTTON_GET_TICK() - self->private_time_stamp_interrupt 
        > KIM_BUTTON_PUSH_DELAY_TIME)
    {
        /* Check the GPIO Pin again */
        if(KIM_BUTTON_READ_PIN(gpiox_base, gpio_pin_x) == Normal_Bit_Val)
        {
            if(self->private_push_time == 0) {
                self->private_state = Kim_Button_State_Wait_For_Interrupt;
            } else {
                self->private_state = Kim_Button_State_Wait_For_Repeat;
            }
        } else {
            self->private_state = Kim_Button_State_Wait_For_End;
        }
    }
}

KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_StateWFEHandler(
    struct Kim_Button_TypeDef* const self,
    const uint32_t gpiox_base,
    const uint16_t gpio_pin_x,
    const uint8_t Normal_Bit_Val
)
{
    if(KIM_BUTTON_READ_PIN(gpiox_base, gpio_pin_x) == Normal_Bit_Val)
    {
        self->private_state = Kim_Button_State_Release_Delay;
    }
    else if(KIM_BUTTON_GET_TICK() - self->private_time_stamp_interrupt 
        > KIM_BUTTON_SAFE_PUSH_MAX_TIME)
    {
#if defined(KIM_BUTTON_DEBUG)
        KIM_BUTTON_DEBUG_ERROR_HOOK();
#else
        self->private_push_time = 0;
        self->private_state = Kim_Button_State_Wait_For_Interrupt;
#endif /* debug mode */
    }
}

KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_StateRepeatPushHandler(
    struct Kim_Button_TypeDef* const self,
    Kim_Button_RepeatPushCallBack_t repeat_push_callback
)
{
    KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */

#if KIM_BUTTON_ENABLE_BUTTON_MORE_REPEAT == 0
    KIM_BUTTON_SAFE_CALLBACK(repeat_push_callback);
#else
    if(repeat_push_callback != 0) {
        repeat_push_callback(self->private_push_time);
    }
#endif /* more repeat */
    
    KIM_BUTTON_CRITICAL_ZONE_BEGIN(); /* Critical Zone Begin */
    self->private_push_time = 0;
    self->private_time_stamp_loop = KIM_BUTTON_GET_TICK();
    self->private_state = Kim_Button_State_Cool_Down;
}

KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_StateWFRHandler(
    struct Kim_Button_TypeDef* const self
)
{
    KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */

    KIM_BUTTON_ALWAYS_CRITICAL_ZONE_BEGIN(); /* ALWAYS critical zone begin */
    if(KIM_BUTTON_GET_TICK() - self->private_time_stamp_loop
#if KIM_BUTTON_ONLY_USE_DEFAULT_TIME == 0
        > (uint32_t)self->public_repeat_push_max_time
#else
        > KIM_BUTTON_REPEAT_PUSH_MAX_TIME
#endif /* KIM_BUTTON_ONLY_USE_DEFAULT_TIME */
    )
    {
#if KIM_BUTTON_ENABLE_BUTTON_MORE_REPEAT == 0
        self->private_state = Kim_Button_State_Single_Push;
#else
        if(self->private_push_time == 1) {
            self->private_state = Kim_Button_State_Single_Push;
        } else {
            self->private_state = Kim_Button_State_Repeat_Push;
        }
#endif /* more repeat */
    }
    KIM_BUTTON_ALWAYS_CRITICAL_ZONE_END(); /* ALWAYS critical zone end */

    KIM_BUTTON_CRITICAL_ZONE_BEGIN(); /* Critical Zone Begin */
}

KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_StateSiglePushHandler(
    struct Kim_Button_TypeDef* const self,
    Kim_Button_ShortPushCallBack_t short_push_callback,
    Kim_Button_LongPushCallBack_t long_push_callback
)
{
    if(KIM_BUTTON_GET_TICK() - self->private_time_stamp_interrupt
#if KIM_BUTTON_ONLY_USE_DEFAULT_TIME == 0
        > (uint32_t)self->public_long_push_min_time
#else
        > KIM_BUTTON_LONG_PUSH_MIN_TIME
#endif /* KIM_BUTTON_ONLY_USE_DEFAULT_TIME */
    )
    { 
#if KIM_BUTTON_ENABLE_DIFFERENT_TIME_LONG_PUSH == 0
        KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */
        KIM_BUTTON_SAFE_CALLBACK(long_push_callback);
#else
        uint32_t long_push_tick = KIM_BUTTON_GET_TICK() - self->private_time_stamp_interrupt;
        KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */
        if(long_push_callback != ((void*)0)) {
            long_push_callback(long_push_tick); 
        }
#endif /* different long push time */
    } else {
        KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */
        KIM_BUTTON_SAFE_CALLBACK(short_push_callback);
    }
    
    KIM_BUTTON_CRITICAL_ZONE_BEGIN(); /* Critical Zone Begin */
    self->private_push_time = 0;
    self->private_time_stamp_loop = KIM_BUTTON_GET_TICK();
    self->private_state = Kim_Button_State_Cool_Down;
}

KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_StateReleaseDelayHandler(
    struct Kim_Button_TypeDef* const self,
    const uint32_t gpiox_base,
    const uint16_t gpio_pin_x,
    const uint8_t Normal_Bit_Val
)
{
    if(KIM_BUTTON_GET_TICK() - self->private_time_stamp_loop 
        > KIM_BUTTON_RELEASE_DELAY_TIME)
    {
        /* Delay time is over */
        if(KIM_BUTTON_READ_PIN(gpiox_base, gpio_pin_x) == Normal_Bit_Val)
        {
            self->private_push_time ++;
            self->private_time_stamp_loop = KIM_BUTTON_GET_TICK();

#if KIM_BUTTON_ENABLE_BUTTON_MORE_REPEAT == 0 /* more repeat */
            self->private_state = (self->private_push_time == 1)
                ? Kim_Button_State_Wait_For_Repeat : Kim_Button_State_Repeat_Push;
#else
            self->private_state = (self->private_push_time < 7)
                ? Kim_Button_State_Wait_For_Repeat : Kim_Button_State_Repeat_Push;
#endif /* more repeat */

#if KIM_BUTTON_ENABLE_BUTTON_COMBINATION != 0 /* combination button */

            if(self->public_comb_before_button == 0 || self->public_comb_callback == 0)
            {
                return;
            }
            /* check button-[before] */
            if(self->public_comb_before_button->private_state != Kim_Button_State_Combination_WaitForEnd)
            {
                if(self->public_comb_before_button->private_state != Kim_Button_State_Wait_For_End) {
                    return;
                } else {
                    self->public_comb_before_button->private_state = Kim_Button_State_Combination_WaitForEnd;
                }
            }
            self->private_state = Kim_Button_State_Combination_Push;
#endif /* combination button */

        } else {
            self->private_state = Kim_Button_State_Wait_For_End;
        }
    }
}

